{
  "form": "Form I-485",
  "revision": "1/17/17",
  "sections": {
    "s1": {
      "label": "Part 1. Information About You"
    },
    "s2": {
      "label": "Part 2. Application Type (Select one)"
    },
    "s3": {
      "label": "Part 3. Processing Information",
      "a": {
        "label": "A"
      },
      "b": {
        "label": "B: List your present spouse and all of your children (include adult sons and daughters). (If you have none, write 'None.' If additional space is needed, see Page 3 of the instructions.)",
        "repeat": true
      },
      "c": {
        "label": "C: List your present and past membership in or affiliation with every organization, association, fund, foundation, party, club, society, or similar group in the United States or in other places since your 16th birthday. Include any military service in this part. If none, write 'None.' Include the name of each organization, location, nature, and dates of membership. If additional space is needed, attach a separate sheet of paper. Continuation pages must be submitted according to the guidelines provided on Page 3 of the instructions under General Instructions.",
        "repeat": true
      },
      "d": {
        "label": "Answer the following questions. (If your answer is 'Yes' to any question, explain on a separate piece of paper. Continuation pages must be submitted according to the guidelines provided on Page 3 of the instructions under General Instructions. Information about documentation that must be included with your application is also provided in this section.) Answering 'Yes' does not necessarily mean that you are not entitled to adjust status or register for permanent residence."
      }
    },
    "s4": {
      "label": "Part 4. Accommodations for Individuals With Disabilities and/or Impairments (See Page 7 of the instructions before completing this section.)"
    },
    "s5": {
      "label": "Part 5. Signature (Read the information on penalties on Page 8 of the instructions before completing this section. You must file this application while in the United States.)"
    }
  },
  "fields": {
    "s1": {
      "f1": {
        "label": "Family Name (Last Name)",
        "type": "text",
        "required": true
      },
      "f2": {
        "label": "Given Name (First Name)",
        "type": "text",
        "required": true
      },
      "f3": {
        "label": "Middle Name",
        "type": "text",
        "required": false
      },
      "f4": {
        "label": "Address - Street Number and Name",
        "type": "text",
        "required": true
      },
      "f5": {
        "label": "Apt. No.",
        "type": "text",
        "required": true
      },
      "f6": {
        "label": "C/O (in care of)",
        "type": "text",
        "required": false
      },
      "f7": {
        "label": "City",
        "type": "text",
        "required": true
      },
      "f8": {
        "label": "State",
        "type": "text",
        "required": true
      },
      "f9": {
        "label": "ZIP Code",
        "type": "text",
        "required": true
      },
      "f10": {
        "label": "Date of Birth (mm/dd/yyyy)",
        "type": "date",
        "required": true
      },
      "f11": {
        "label": "Country of Birth",
        "type": "text",
        "required": true
      },
      "f12": {
        "label": "Country of Citizenship/Nationality",
        "type": "text",
        "required": true
      },
      "f13": {
        "label": "U.S. Social Security No. (if any)",
        "type": "text",
        "required": false
      },
      "f14": {
        "label": "A-Number (if any)",
        "type": "text",
        "required": false
      },
      "f15": {
        "label": "Date of Last Arrival (mm/dd/yyyy)",
        "type": "date",
        "required": true
      },
      "f16": {
        "label": "I-94 Arrival-Departure Record Number",
        "type": "text",
        "required": true
      },
      "f17": {
        "label": "Current USCIS Status",
        "type": "text",
        "required": true
      },
      "f18": {
        "label": "Expires on (mm/dd/yyyy)",
        "type": "date",
        "required": true
      }
    },
    "s2": {
      "f1": {
        "label": "I am applying for an adjustment to permanent resident status because:",
        "type": "checkbox",
        "required": true,
        "options": {
          "a": "An immigrant petition giving me an immediately available immigrant visa number that has been approved. (Attach a copy of the approval notice, or a relative, special immigrant juvenile, or special immigrant military visa petition filed with this application that will give you an immediately available visa number, if approved.)",
          "b": "My spouse or parent applied for adjustment of status or was granted lawful permanent residence in an immigrant visa category that allows derivative status for spouses and children.",
          "c": "I entered as a K-1 fiancé(e) of a U.S. citizen whom I married within 90 days of entry, or I am the K-2 child of such a fiancé(e). (Attach a copy of the fiancé(e) petition approval notice and the marriage certificate.)",
          "d": "I was granted asylum or derivative asylum status as the spouse or child of a person granted asylum and am eligible for adjustment.",
          "e": "I am a native or citizen of Cuba admitted or paroled into the United States after January 1, 1959, and thereafter have been physically present in the United States for at least 1 year.",
          "f": "I am the husband, wife, or minor unmarried child of a Cuban described above in (e), and I am residing with that person, and was admitted or paroled into the United States after January 1, 1959, and thereafter have been physically present in the United States for at least 1 year.",
          "g": "I have continuously resided in the United States since before January 1, 1972.",
          "h": "Other basis of eligibility. Explain (for example, I was admitted as a refugee, my status has not been terminated, and I have been physically present in the United States for 1 year after admission). If additional space is needed, see Page 3 of the instructions."
        }
      },
      "f2": {
        "label": "I am already a permanent resident and am applying to have the date I was granted permanent residence adjusted to the date I originally arrived in the United States as a nonimmigrant or parolee, or as of May 2, 1964, whichever date is later, and: (Select one)",
        "type": "checkbox",
        "required": true,
        "options": {
          "i": "I am a native or citizen of Cuba and meet the description in (e) above.",
          "j": "I am the husband, wife, or minor unmarried child of a Cuban and meet the description in (f) above."
        }
      }
    },
    "s3-a": {
      "f1": {
        "label": "City/Town/Village of Birth",
        "type": "text",
        "required": true
      },
      "f2": {
        "label": "Current Occupation",
        "type": "text",
        "required": true
      },
      "f3": {
        "label": "Your Mother's First Name",
        "type": "text",
        "required": true
      },
      "f4": {
        "label": "Your Father's First Name",
        "type": "text",
        "required": true
      },
      "f5": {
        "label": "Provide your name exactly as it appears on your Form I-94, Arrival-Departure Record Number",
        "type": "text",
        "required": true
      },
      "f6": {
        "label": "Place of Last Entry Into the United States (City/State)",
        "type": "text",
        "required": true
      },
      "f7": {
        "label": "In what status did you last enter? (Visitor, student, exchange visitor, crewman, temporary worker, without inspection, etc.)",
        "type": "text",
        "required": true
      },
      "f8": {
        "label": "Were you inspected by a U.S. Immigration Officer?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f9": {
        "label": "Nonimmigrant Visa Number",
        "type": "text",
        "required": true
      },
      "f10": {
        "label": "Consulate Where Visa Was Issued",
        "type": "text",
        "required": true
      },
      "f11": {
        "label": "Date Visa Issued (mm/dd/yyyy)",
        "type": "date",
        "required": true
      },
      "f12": {
        "label": "Gender",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Male",
          "two": "Female"
        }
      },
      "f13": {
        "label": "Marital Status",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Married",
          "two": "Single",
          "three": "Divorced",
          "four": "Widowed"
        }
      },
      "f14": {
        "label": "Have you ever applied for permanent resident status in the U.S.?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes (If 'Yes' give date and place of filing and final disposition.)",
          "two": "No"
        }
      }
    },
    "s3-b": {
      "f1": {
        "label": "Family Name (Last Name)",
        "type": "text",
        "required": true
      },
      "f2": {
        "label": "Given Name (First Name)",
        "type": "text",
        "required": true
      },
      "f3": {
        "label": "Middle Initial",
        "type": "text",
        "required": true
      },
      "f4": {
        "label": "Date of Birth (mm/dd/yyyy)",
        "type": "text",
        "required": true
      },
      "f5": {
        "label": "Country of Birth",
        "type": "text",
        "required": true
      },
      "f6": {
        "label": "Relationship",
        "type": "text",
        "required": true
      },
      "f7": {
        "label": "A-Number (if any)",
        "type": "text",
        "required": false
      },
      "f8": {
        "label": "Applying with you?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      }
    },
    "s3-c": {
      "f1": {
        "label": "Name of Organization",
        "type": "text",
        "required": true
      },
      "f2": {
        "label": "Location and Nature",
        "type": "text",
        "required": true
      },
      "f3": {
        "label": "Date of Membership From",
        "type": "date",
        "required": true
      },
      "f4": {
        "label": "Date of Membership To",
        "type": "date",
        "required": true
      }
    },
    "s3-d": {
      "f1": {
        "label": "Have you EVER, in or outside the United States:",
        "type": "multi-checkbox",
        "required": true,
        "options": {
          "a": "Knowingly committed any crime of moral turpitude or a drug-related offense for which you have not been arrested?",
          "b": "Been arrested, cited, charged, indicted, convicted, fined, or imprisoned for breaking or violating any law or ordinance, excluding traffic violations?",
          "c": "Been the beneficiary of a pardon, amnesty, rehabilitation decree, other act of clemency, or similar action?",
          "d": "Exercised diplomatic immunity to avoid prosecution for a criminal offense in the United States?"
        }
      },
      "f2": {
        "label": "Have you received public assistance in the United States from any source, including the U.S. Government or any State, county, city, or municipality (other than emergency medical treatment), or are you likely to receive public assistance in the future?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f3": {
        "label": "Have you EVER:",
        "type": "multi-checkbox",
        "required": true,
        "options": {
          "a": "Within the past 10 years been a prostitute or procured anyone for prostitution, or intend to engage in such activities in the future?",
          "b": "Engaged in any unlawful commercialized vice, including, but not limited to, illegal gambling?",
          "c": "Knowingly encouraged, induced, assisted, abetted, or aided any alien to try to enter the United States illegally?",
          "d": "Illicitly trafficked in any controlled substance, or knowingly assisted, abetted, or colluded in the illicit trafficking of any controlled substance?"
        }
      },
      "f4": {
        "label": "Have you EVER engaged in, conspired to engage in, or do you intend to engage in, or have you ever solicited membership or funds for, or have you through any means ever assisted or provided any type of material support to any person or organization that has ever engaged or conspired to engage in sabotage, kidnapping, political assassination, hijacking, or any other form of terrorist activity?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f5": {
        "label": "Do you intend to engage in the United States in:",
        "type": "multi-checkbox",
        "required": true,
        "options": {
          "a": "Espionage?",
          "b": "Any activity a purpose of which is opposition to, or the control or overthrow of, the Government of the Yes No United States, by force, violence, or other unlawful means?",
          "c": "Any activity to violate or evade any law prohibiting the export from the United States of goods, Yes No technology, or sensitive information?"
        }
      },
      "f6": {
        "label": "Have you EVER been a member of, or in any way affiliated with, the Communist Party or any other Yes No totalitarian party?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f7": {
        "label": "Did you, during the period from March 23, 1933 to May 8, 1945, in association with either the Nazi Yes No Government of Germany or any organization or government associated or allied with the Nazi Government of Germany, ever order, incite, assist, or otherwise participate in the persecution of any person because of race, religion, national origin, or political opinion?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f8": {
        "label": "Have you EVER been deported from the United States, or removed from the United States at government Yes No expense, excluded within the past year, or are you now in exclusion, deportation, removal, or rescission proceedings?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f9": {
        "label": "Are you under a final order of civil penalty for violating section 274C of the Immigration and Nationality Yes No Act (INA) for use of fraudulent documents or have you, by fraud or willful misrepresentation of a material fact, ever sought to procure, or procured, a visa, other documentation, entry into the United States, or any immigration benefit?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f10": {
        "label": "Have you EVER left the United States to avoid being drafted into the U.S. Armed Forces?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f11": {
        "label": "Have you EVER been a J nonimmigrant exchange visitor who was subject to the 2-year foreign residence Yes No requirement and have not yet complied with that requirement or obtained a waiver?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f12": {
        "label": "Are you now withholding custody of a U.S. citizen child outside the United States from a person granted Yes No custody of the child?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f13": {
        "label": "Do you plan to practice polygamy in the United States?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f14": {
        "label": "Have you EVER ordered, incited, called for, committed, assisted, helped with, or otherwise participated in any of the following:",
        "type": "checkbox",
        "required": true,
        "options": {
          "a": "Acts involving torture or genocide?",
          "b": "Killing any person?",
          "c": "Intentionally and severely injuring any person?",
          "d": "Engaging in any kind of sexual contact or relations with any person who was being forced or threatened?",
          "e": "Limiting or denying any person's ability to exercise religious beliefs?"
        }
      },
      "f15": {
        "label": "Have you EVER:",
        "type": "checkbox",
        "required": true,
        "options": {
          "a": "Served in, been a member of, assisted in, or participated in any military unit, paramilitary unit, police unit,self-defense unit, vigilante unit, rebel group, guerrilla group, militia, or insurgent organization?",
          "b": "Served in any prison, jail, prison camp, detention facility, labor camp, or any other situation that involved Yes No detaining persons?"
        }
      },
      "f16": {
        "label": "Have you EVER been a member of, assisted in, or participated in any group, unit, or organization of any Yes No kind in which you or other persons used any type of weapon against any person or threatened to do so?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f17": {
        "label": "Have you EVER assisted or participated in selling or providing weapons to any person who to your Yes No knowledge used them against another person, or in transporting weapons to any person who to your knowledge used them against another person?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f18": {
        "label": "Have you EVER received any type of military, paramilitary, or weapons training?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      }
    },
    "s4": {
      "f1": {
        "label": "Are you requesting an accommodation because of your disability(ies) and/or impairment(s)?",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "Yes",
          "two": "No"
        }
      },
      "f2": {
        "label": "If you answered 'Yes,' select any applicable box:",
        "type": "multi-checkbox",
        "required": true,
        "options": {
          "a": "I am deaf or hard of hearing and request the following accommodation(s) (if requesting a sign-language interpreter, indicate which language (e.g., American Sign Language)):",
          "b": "I am blind or sight-impaired and request the following accommodation(s):",
          "c": "I have another type of disability and/or impairment (describe the nature of your disability(ies) and/or impairment(s) and accommodation(s) you are requesting):"  
        }
      }
    },
    "s5": {
      "f1": {
        "label": "Applicant's Statement (Select One)",
        "type": "checkbox",
        "required": true,
        "options": {
          "one": "I can read and understand English, and I have read and understand each and every question and instruction on this form, as well as my answer to each question.",
          "two": "Each and every question and instruction on this form, as well as my answer to each question, has been read to me in the language, a language in which I am fluent by the person named in Interpreter's Statement and Signature. I understand each and every question and instruction on this form, as well as my answer to each question."
        }
      },
      "f2": {
        "label": "Signature (Applicant)",
        "type": "text",
        "required": true
      },
      "f3": {
        "label": "Print Your Full Name",
        "type": "text",
        "required": true
      },
      "f4": {
        "label": "Date (mm/dd/yyyy)",
        "type": "date",
        "required": true
      },
      "f5": {
        "label": "Daytime Phone Number (include area code)",
        "type": "phone",
        "required": true
      }
    }
  },
  "annotations": {
    "s1": {

    },
    "s2": {

    },
    "s3-a": {

    },
    "s3-b": {

    },
    "s3-c": {

    },
    "s3-d": {

    },
    "s4": {

    },
    "s5": {

    }
  }
}